{
  "categorias": [
    {
      "id": 1,
      "name": "Acción"
    },
    {
      "id": 2,
      "name": "Ropa"
    },
    {
      "id": 3,
      "name": "Libros y cómics"
    }
  ],
  "productos": [
    {
      "id": 1,
      "name": "Figura de acción de Iron Man",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 29.99,
      "categoryId": 1,
      "description": "Figura de acción detallada de Iron Man, inspirada en el famoso superhéroe de Marvel. Perfecta para coleccionistas y fanáticos de los Vengadores."
    },
    {
      "id": 2,
      "name": "Peluche de Pikachu",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 14.99,
      "categoryId": 1,
      "description": "Adorable peluche de Pikachu, el icónico personaje amarillo de la serie Pokémon. Ideal para regalar a niños y fans de la franquicia."
    },
    {
      "id": 3,
      "name": "Juego de mesa Catan",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 34.99,
      "categoryId": 1,
      "description": "Juego de mesa Catan, un emocionante juego de estrategia y comercio donde los jugadores construyen y colonizan una isla. Perfecto para disfrutar en familia o con amigos."
    },
    {
      "id": 4,
      "name": "Funko Pop de Wonder Woman",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 12.99,
      "categoryId": 1,
      "description": "Figura Funko Pop de Wonder Woman, representando a la valiente amazona de DC Comics. Una adición genial para cualquier colección de figuras Pop."
    },
    {
      "id": 5,
      "name": "Funko Pop de Spider-Man",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 12.99,
      "categoryId": 1,
      "description": "Figura Funko Pop de Spider-Man, mostrando al icónico héroe arácnido de Marvel. Un regalo ideal para los fanáticos de los cómics y películas de Spider-Man."
    },
    {
      "id": 6,
      "name": "Camiseta de Iron Man",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 19.99,
      "categoryId": 1,
      "description": "Camiseta de Iron Man con un diseño elegante y resistente. Muestra tu amor por Tony Stark y su armadura roja y dorada."
    },
    {
      "id": 7,
      "name": "Lámpara de Star Wars",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 24.99,
      "categoryId": 1,
      "description": "Lámpara temática de Star Wars con un diseño único que presenta los símbolos icónicos de la saga. Ilumina tu hogar con el espíritu de la galaxia muy, muy lejana."
    },
    {
      "id": 8,
      "name": "Camiseta de Star Wars",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 19.99,
      "categoryId": 2,
      "description": "Camiseta de Star Wars para los verdaderos fanáticos de la saga. Muestra tu lealtad hacia el Lado Oscuro o la Fuerza con este diseño auténtico."
    },
    {
      "id": 9,
      "name": "Taza de Game of Thrones",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 12.99,
      "categoryId": 2,
      "description": "Taza inspirada en Game of Thrones con el emblema de una de las casas nobles de Westeros. Ideal para disfrutar de tus bebidas calientes mientras te sumerges en las intrigas políticas de Poniente."
    },
    {
      "id": 10,
      "name": "Póster de Star Wars",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 8.99,
      "categoryId": 2,
      "description": "Póster decorativo de Star Wars que muestra un emocionante momento de la saga. Decora tus paredes con la épica historia de la lucha entre la Alianza Rebelde y el Imperio Galáctico."
    },
    {
      "id": 11,
      "name": "Taza de Rick and Morty",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 12.99,
      "categoryId": 2,
      "description": "Taza con diseños de Rick and Morty, la famosa serie animada llena de humor y aventuras intergalácticas. Disfruta de tus bebidas con un toque de ciencia ficción y sarcasmo."
    },
    {
      "id": 12,
      "name": "Lámpara de Harry Potter",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 24.99,
      "categoryId": 2,
      "description": "Lámpara mágica de Harry Potter con el emblema de Hogwarts. Ilumina tu habitación con la magia del mundo de Harry Potter y la sabiduría de Albus Dumbledore."
    },
    {
      "id": 13,
      "name": "Libro de Batman",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 15.99,
      "categoryId": 2,
      "description": "Libro de Batman, con emocionantes historias del Caballero Oscuro luchando contra los villanos de Gotham City. Sumérgete en las aventuras de uno de los superhéroes más emblemáticos de DC Comics."
    },
    {
      "id": 14,
      "name": "Libro de Harry Potter",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 19.99,
      "categoryId": 2,
      "description": "Libro de Harry Potter, que te transportará al mundo mágico de J.K. Rowling. Únete a Harry, Hermione y Ron en su lucha contra Lord Voldemort y descubre los misterios de Hogwarts."
    },
    {
      "id": 15,
      "name": "Cómic de Batman",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 9.99,
      "categoryId": 3,
      "description": "Cómic de Batman lleno de acción, con viñetas emocionantes que muestran al Caballero Oscuro combatiendo el crimen en las calles oscuras de Gotham City. Un imprescindible para los amantes de los cómics."
    },
    {
      "id": 16,
      "name": "Cómic de Spider-Man",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 9.99,
      "categoryId": 3,
      "description": "Cómic de Spider-Man que sigue las aventuras de Peter Parker mientras balancea entre edificios y lucha contra supervillanos. Descubre las historias que hicieron famoso al Hombre Araña."
    },
    {
      "id": 17,
      "name": "Cómic de Superman",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 9.99,
      "categoryId": 3,
      "description": "Cómic de Superman, con las hazañas del Hombre de Acero mientras protege Metrópolis y defiende la justicia. Únete a Clark Kent en su lucha contra las fuerzas del mal."
    },
    {
      "id": 18,
      "name": "Libro de El Señor de los Anillos",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 21.99,
      "categoryId": 3,
      "description": "Libro de El Señor de los Anillos, una epopeya fantástica que te llevará a tierras míticas y peligrosas en busca del poderoso Anillo Único. Embárcate en la aventura de Frodo y sus compañeros."
    },
    {
      "id": 19,
      "name": "Libro de Spider-Man",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 15.99,
      "categoryId": 3,
      "description": "Libro de Spider-Man que explora la vida y los desafíos de Peter Parker dentro y fuera del traje de superhéroe. Conoce más sobre el hombre detrás de la máscara."
    },
    {
      "id": 20,
      "name": "Libro de Wonder Woman",
      "imgUrl": "https://picsum.photos/306/304",
      "price": 18.99,
      "categoryId": 3,
      "description": "Libro de Wonder Woman que narra las increíbles hazañas de Diana Prince, la princesa amazona que defiende la paz y la justicia en un mundo lleno de peligros. Descubre el poder de las Amazonas."
    }
  ]
}